muliangshou/UVirtio/Ubiquitous/XiZi/board/stm32f407-st-discovery/third_party_driver/uart/connect_usart.c
    switch (serial_operation_cmd)
    {
        case OPER_CLR_INT:
            UART_DISABLE_IRQ(serial_hw_cfg->irq);
            USART_ITConfig(serial_hw_cfg->uart_device, USART_IT_RXNE, DISABLE);
            break;
        case OPER_SET_INT:
            UART_ENABLE_IRQ(serial_hw_cfg->irq);
            USART_ITConfig(serial_hw_cfg->uart_device, USART_IT_RXNE, ENABLE);
            break;
        case OPER_CONFIG :
            if (SIGN_OPER_DMA_RX == serial_dev_param->serial_set_mode) {
                DMAConfiguration(serial_dev, serial_hw_cfg->uart_device);
            }
    }

    return EOK;
}

#ifdef RESOURCES_VIRTIO
static uint32 Stm32VirtioSerialConfigure(struct VirtioDriver *virtio_drv, int serial_operation_cmd)
{
    NULL_PARAM_CHECK(virtio_drv);

    struct VirtioHardwareDevice *virtio_dev = (struct VirtioHardwareDevice *)virtio_drv->driver.owner_bus->owner_haldev;
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)virtio_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;
    struct SerialDevParam *serial_dev_param = (struct SerialDevParam *)virtio_dev->haldev.private_data;

    switch (serial_operation_cmd)
    {
        case OPER_CLR_INT:
            UART_DISABLE_IRQ(serial_hw_cfg->irq);
            USART_ITConfig(serial_hw_cfg->uart_device, USART_IT_RXNE, DISABLE);
            break;
        case OPER_SET_INT:
            UART_ENABLE_IRQ(serial_hw_cfg->irq);
            USART_ITConfig(serial_hw_cfg->uart_device, USART_IT_RXNE, ENABLE);
            break;
        case OPER_CONFIG :
            KPrintf("DMA not supported yet.\n");
            break;
            // if (SIGN_OPER_DMA_RX == serial_dev_param->serial_set_mode) {
            //     DMAConfiguration(virtio_dev, serial_hw_cfg->uart_device);
            // }
    }

    return EOK;
}

static int Stm32VirtioSerialPutchar(struct VirtioHardwareDevice *virtio_dev, char c)
{
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)virtio_dev->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    while (!(serial_hw_cfg->uart_device->SR & USART_FLAG_TXE));
    serial_hw_cfg->uart_device->DR = c;

    return EOK;
}

static int Stm32VirtioSerialGetchar(struct VirtioHardwareDevice *virtio_dev)
{
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)virtio_dev->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    int ch = -1;
    if (serial_hw_cfg->uart_device->SR & USART_FLAG_RXNE) {
        ch = serial_hw_cfg->uart_device->DR & 0xff;
    }

    return ch;
}
#endif

static int Stm32SerialPutchar(struct SerialHardwareDevice *serial_dev, char c)
{
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_dev->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    while (!(serial_hw_cfg->uart_device->SR & USART_FLAG_TXE));
    serial_hw_cfg->uart_device->DR = c;

    return EOK;
}

static int Stm32SerialGetchar(struct SerialHardwareDevice *serial_dev)
{
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_dev->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    int ch = -1;
    if (serial_hw_cfg->uart_device->SR & USART_FLAG_RXNE) {
        ch = serial_hw_cfg->uart_device->DR & 0xff;
    }

    return ch;
}

static void DmaUartRxIdleIsr(struct SerialHardwareDevice *serial_dev, struct Stm32UsartDma *dma, USART_TypeDef *uart_device)
{
    x_base level = CriticalAreaLock();

    x_size_t recv_total_index = dma->SettingRecvLen - DMA_GetCurrDataCounter(dma->RxStream);
    x_size_t recv_len = recv_total_index - dma->LastRecvIndex;
    dma->LastRecvIndex = recv_total_index;
    CriticalAreaUnLock(level);

    if (recv_len) SerialSetIsr(serial_dev, SERIAL_EVENT_RX_DMADONE | (recv_len << 8));

    USART_ReceiveData(uart_device);
}

static void DmaRxDoneIsr(struct Stm32Usart *serial, struct SerialDriver *serial_drv, struct SerialHardwareDevice *serial_dev)
{
    struct Stm32UsartDma *dma = &serial->dma; 
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    if (DMA_GetFlagStatus(dma->RxStream, dma->RxFlag) != RESET) {
        x_base level = CriticalAreaLock();

        x_size_t recv_len;

        x_size_t recv_total_index = dma->SettingRecvLen - DMA_GetCurrDataCounter(dma->RxStream);
        if (0 != recv_total_index) {
            recv_len = recv_total_index - dma->LastRecvIndex;
        } else {
            recv_len = dma->SettingRecvLen - dma->LastRecvIndex;
        }
        dma->LastRecvIndex = recv_total_index;

        CriticalAreaUnLock(level);

        if (recv_len) SerialSetIsr(serial_dev, SERIAL_EVENT_RX_DMADONE | (recv_len << 8));

        DMA_ClearFlag(dma->RxStream, dma->RxFlag);
    }
}

static void UartIsr(struct Stm32Usart *serial, struct SerialDriver *serial_drv, struct SerialHardwareDevice *serial_dev)
{
    struct Stm32UsartDma *dma = &serial->dma; 
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    if (USART_GetITStatus(serial_hw_cfg->uart_device, USART_IT_RXNE) != RESET) {
        SerialSetIsr(serial_dev, SERIAL_EVENT_RX_IND);
        USART_ClearITPendingBit(serial_hw_cfg->uart_device, USART_IT_RXNE);
    } else if (USART_GetITStatus(serial_hw_cfg->uart_device, USART_IT_IDLE) != RESET) {
        DmaUartRxIdleIsr(serial_dev, dma, serial_hw_cfg->uart_device);
    } else if (USART_GetITStatus(serial_hw_cfg->uart_device, USART_IT_TC) != RESET) {
        USART_ClearITPendingBit(serial_hw_cfg->uart_device, USART_IT_TC);
    } else {
        if (USART_GetFlagStatus(serial_hw_cfg->uart_device, USART_FLAG_ORE) == SET) {
            USART_ReceiveData(serial_hw_cfg->uart_device);
        }
    }
}

#ifdef RESOURCES_VIRTIO
static void UartVirtioIsr(struct VirtioDriver *virtio_drv, struct VirtioHardwareDevice *virtio_dev)
{
    // struct Stm32UsartDma *dma = &serial->dma; 
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)virtio_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

