muliangshou/UVirtio/Ubiquitous/XiZi/board/stm32f407-st-discovery/third_party_driver/uart/connect_usart.c
/*manage the serial device operations*/
static const struct SerialDrvDone drv_done =
{
    .init = Stm32SerialInit,
    .configure = Stm32SerialConfigure,
};

#ifdef RESOURCES_VIRTIO
/*manage the serial device operations*/
static const struct VirtioDrvDone drv_done_virtio =
{
    .init = Stm32VirtioSerialInit,
    .configure = Stm32VirtioSerialConfigure,
};

/*manage the serial device hal operations*/
static struct VirtioHwDevDone hwdev_done_virtio =
{
    .put_char = Stm32VirtioSerialPutchar,
    .get_char = Stm32VirtioSerialGetchar,
};

static int BoardVirtioSerialBusInit(struct VirtioBus *virtio_bus, struct VirtioDriver *virtio_driver, const char *bus_name, const char *drv_name)
{
    x_err_t ret = EOK;

    /*Init the virtio bus */
    ret = VirtioBusInit(virtio_bus, bus_name);
    if (EOK != ret) {
        KPrintf("hw_virtio_init VirtioBusInit error %d\n", ret);
        return ERROR;
    }

    /*Init the virtio driver*/
    ret = VirtioDriverInit(virtio_driver, drv_name);
    if (EOK != ret) {
        KPrintf("hw_virtio_init VirtioDriverInit error %d\n", ret);
        return ERROR;
    }

    /*Attach the virtio driver to the virtio bus*/
    ret = VirtioDriverAttachToBus(drv_name, bus_name);
    if (EOK != ret) {
        KPrintf("hw_virtio_init VirtioDriverAttachToBus error %d\n", ret);
        return ERROR;
    } 

    return ret;
}

/*Attach the virtio device to the virtio bus*/
static int BoardVirtioSerialDevBend(struct VirtioHardwareDevice *virtio_device, void *serial_param, const char *bus_name, const char *dev_name)
{
    x_err_t ret = EOK;

    ret = VirtioDeviceRegister(virtio_device, serial_param, dev_name);
    if (EOK != ret) {
        KPrintf("hw_virtio_init VirtioDeviceInit device %s error %d\n", dev_name, ret);
        return ERROR;
    }  

    ret = VirtioDeviceAttachToBus(dev_name, bus_name);
    if (EOK != ret) {
        KPrintf("hw_virtio_init VirtioDeviceAttachToBus device %s error %d\n", dev_name, ret);
        return ERROR;
    }  

    return  ret;
}
#endif

/*manage the serial device hal operations*/
static struct SerialHwDevDone hwdev_done =
{
    .put_char = Stm32SerialPutchar,
    .get_char = Stm32SerialGetchar,
};

static int BoardSerialBusInit(struct SerialBus *serial_bus, struct SerialDriver *serial_driver, const char *bus_name, const char *drv_name)
{
    x_err_t ret = EOK;

    /*Init the serial bus */
    ret = SerialBusInit(serial_bus, bus_name);
    if (EOK != ret) {
        KPrintf("hw_serial_init SerialBusInit error %d\n", ret);
        return ERROR;
    }

    /*Init the serial driver*/
    ret = SerialDriverInit(serial_driver, drv_name);
    if (EOK != ret) {
        KPrintf("hw_serial_init SerialDriverInit error %d\n", ret);
        return ERROR;
    }

    /*Attach the serial driver to the serial bus*/
    ret = SerialDriverAttachToBus(drv_name, bus_name);
    if (EOK != ret) {
        KPrintf("hw_serial_init SerialDriverAttachToBus error %d\n", ret);
        return ERROR;
    } 

    return ret;
}

/*Attach the serial device to the serial bus*/
static int BoardSerialDevBend(struct SerialHardwareDevice *serial_device, void *serial_param, const char *bus_name, const char *dev_name)
{
    x_err_t ret = EOK;

    ret = SerialDeviceRegister(serial_device, serial_param, dev_name);
    if (EOK != ret) {
        KPrintf("hw_serial_init SerialDeviceInit device %s error %d\n", dev_name, ret);
        return ERROR;
    }  

    ret = SerialDeviceAttachToBus(dev_name, bus_name);
    if (EOK != ret) {
        KPrintf("hw_serial_init SerialDeviceAttachToBus device %s error %d\n", dev_name, ret);
        return ERROR;
    }  

    return  ret;
}

int Stm32HwUsartInit(void)
{
    x_err_t ret = EOK;

    RCCConfiguration();
    GPIOConfiguration();

#ifdef BSP_USING_USART1
    static struct SerialCfgParam serial_cfg_1;
    memset(&serial_cfg_1, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_1;
    memset(&serial_hw_cfg_1, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_1;
    memset(&serial_dev_param_1, 0, sizeof(struct SerialDevParam));

    serial_1.dma = usart_dma_1;
    
    serial_driver_1.drv_done = &drv_done;
    serial_driver_1.configure = &Stm32SerialDrvConfigure;
    serial_device_1.hwdev_done = &hwdev_done;

    serial_cfg_1.data_cfg = data_cfg_init;

    serial_hw_cfg_1.uart_device = USART1;
    serial_hw_cfg_1.irq = USART1_IRQn;
    serial_cfg_1.hw_cfg.private_data = (void *)&serial_hw_cfg_1;
    serial_driver_1.private_data = (void *)&serial_cfg_1;

    serial_dev_param_1.serial_work_mode = SIGN_OPER_INT_RX;
#ifdef USART1_USING_DMA
    serial_dev_param_1.serial_work_mode = SIGN_OPER_DMA_RX;
#endif
    serial_device_1.haldev.private_data = (void *)&serial_dev_param_1;

    NVIC_Configuration(serial_hw_cfg_1.irq);

    ret = BoardSerialBusInit(&serial_1.serial_bus, &serial_driver_1, SERIAL_BUS_NAME_1, SERIAL_DRV_NAME_1);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart1 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_1, (void *)&serial_cfg_1, SERIAL_BUS_NAME_1, SERIAL_1_DEVICE_NAME_0);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart1 error ret %u\n", ret);
        return ERROR;
    }    
#endif

#ifdef BSP_USING_USART2
#ifndef RESOURCES_VIRTIO
    static struct SerialCfgParam serial_cfg_2;
    memset(&serial_cfg_2, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_2;
    memset(&serial_hw_cfg_2, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_2;
    memset(&serial_dev_param_2, 0, sizeof(struct SerialDevParam));

    serial_2.dma = usart_dma_2;
    
    serial_driver_2.drv_done = &drv_done;
    serial_driver_2.configure = &Stm32SerialDrvConfigure;
    serial_device_2.hwdev_done = &hwdev_done;

    serial_cfg_2.data_cfg = data_cfg_init;

    serial_hw_cfg_2.uart_device = USART2;
    serial_hw_cfg_2.irq = USART2_IRQn;
    serial_cfg_2.hw_cfg.private_data = (void *)&serial_hw_cfg_2;
    serial_driver_2.private_data = (void *)&serial_cfg_2;

    serial_dev_param_2.serial_work_mode = SIGN_OPER_INT_RX;
#ifdef USART2_USING_DMA
    serial_dev_param_2.serial_work_mode = SIGN_OPER_DMA_RX;
#endif
    serial_device_2.haldev.private_data = (void *)&serial_dev_param_2;

    NVIC_Configuration(serial_hw_cfg_2.irq);

    ret = BoardSerialBusInit(&serial_2.serial_bus, &serial_driver_2, SERIAL_BUS_NAME_2, SERIAL_DRV_NAME_2);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart2 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_2, (void *)&serial_cfg_2, SERIAL_BUS_NAME_2, SERIAL_2_DEVICE_NAME_0);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart2 error ret %u\n", ret);
        return ERROR;
    }    
#endif
#endif

#ifdef RESOURCES_VIRTIO
    static struct SerialCfgParam serial_cfg_virtio;
    memset(&serial_cfg_virtio, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_virtio;
    memset(&serial_hw_cfg_virtio, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_virtio;
    memset(&serial_dev_param_virtio, 0, sizeof(struct SerialDevParam));

