muliangshou/UVirtio/Ubiquitous/XiZi/board/stm32f407-st-discovery/third_party_driver/uart/connect_usart.c
    VirtioRegs *virtio_regs = (VirtioRegs *)x_malloc(sizeof(VirtioRegs));
    memset((void *)virtio_regs, 0, sizeof(VirtioRegs));

    // serial_2.dma = usart_dma_2;
    
    virtio_driver.drv_done = &drv_done_virtio;
    virtio_driver.configure = &Stm32VirtioSerialDrvConfigure;
    virtio_device.hwdev_done = &hwdev_done_virtio;

    serial_cfg_virtio.data_cfg = data_cfg_init;

    serial_hw_cfg_virtio.uart_device = USART2;
    serial_hw_cfg_virtio.irq = USART2_IRQn;
    serial_cfg_virtio.hw_cfg.private_data = (void *)&serial_hw_cfg_virtio;
    virtio_driver.private_data = (void *)&serial_cfg_virtio;

    virtio_regs->MagicValue = VIRTIO_MAGIC;
    virtio_regs->Version = VIRTIO_VERSION;
    virtio_regs->DeviceID = VIRTIO_ID_NETWORK;

    virtio_device.regs = virtio_regs;

    serial_dev_param_virtio.serial_work_mode = SIGN_OPER_INT_RX;
#ifdef USART2_USING_DMA
    serial_dev_param_virtio.serial_work_mode = SIGN_OPER_DMA_RX;
#endif
    virtio_device.haldev.private_data = (void *)&serial_dev_param_virtio;

    NVIC_Configuration(serial_hw_cfg_virtio.irq);

    ret = BoardVirtioSerialBusInit(&virtio_bus, &virtio_driver, VIRTIO_BUS_NAME, VIRTIO_DRV_NAME);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart2 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardVirtioSerialDevBend(&virtio_device, (void *)&serial_cfg_virtio, VIRTIO_BUS_NAME, VIRTIO_DEVICE_NAME);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart2 error ret %u\n", ret);
        return ERROR;
    }    
#endif

#ifdef BSP_USING_USART3
    static struct SerialCfgParam serial_cfg_3;
    memset(&serial_cfg_3, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_3;
    memset(&serial_hw_cfg_3, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_3;
    memset(&serial_dev_param_3, 0, sizeof(struct SerialDevParam));

    serial_3.dma = usart_dma_3;
    
    serial_driver_3.drv_done = &drv_done;
    serial_driver_3.configure = &Stm32SerialDrvConfigure;
    serial_device_3.hwdev_done = &hwdev_done;

    serial_cfg_3.data_cfg = data_cfg_init;

    serial_hw_cfg_3.uart_device = USART3;
    serial_hw_cfg_3.irq = USART3_IRQn;
    serial_cfg_3.hw_cfg.private_data = (void *)&serial_hw_cfg_3;
    serial_driver_3.private_data = (void *)&serial_cfg_3;

    serial_dev_param_3.serial_work_mode = SIGN_OPER_INT_RX;
#ifdef USART3_USING_DMA
    serial_dev_param_3.serial_work_mode = SIGN_OPER_DMA_RX;
#endif
    serial_device_3.haldev.private_data = (void *)&serial_dev_param_3;

    NVIC_Configuration(serial_hw_cfg_3.irq);

    ret = BoardSerialBusInit(&serial_3.serial_bus, &serial_driver_3, SERIAL_BUS_NAME_3, SERIAL_DRV_NAME_3);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart3 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_3, (void *)&serial_cfg_3, SERIAL_BUS_NAME_3, SERIAL_3_DEVICE_NAME_0);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart3 error ret %u\n", ret);
        return ERROR;
    }    
#endif

#ifdef BSP_USING_UART4
    static struct SerialCfgParam serial_cfg_4;
    memset(&serial_cfg_4, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_4;
    memset(&serial_hw_cfg_4, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_4;
    memset(&serial_dev_param_4, 0, sizeof(struct SerialDevParam));

    serial_4.dma = uart_dma_4;
    
    serial_driver_4.drv_done = &drv_done;
    serial_driver_4.configure = &Stm32SerialDrvConfigure;
    serial_device_4.hwdev_done = &hwdev_done;

    serial_cfg_4.data_cfg = data_cfg_init;

    serial_hw_cfg_4.uart_device = UART4;
    serial_hw_cfg_4.irq = UART4_IRQn;
    serial_cfg_4.hw_cfg.private_data = (void *)&serial_hw_cfg_4;
    serial_driver_4.private_data = (void *)&serial_cfg_4;

    serial_dev_param_4.serial_work_mode = SIGN_OPER_INT_RX;
#ifdef USART4_USING_DMA
    serial_dev_param_4.serial_work_mode = SIGN_OPER_DMA_RX;
#endif
    serial_device_4.haldev.private_data = (void *)&serial_dev_param_4;

    NVIC_Configuration(serial_hw_cfg_4.irq);

    ret = BoardSerialBusInit(&serial_4.serial_bus, &serial_driver_4, SERIAL_BUS_NAME_4, SERIAL_DRV_NAME_4);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart4 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_4, (void *)&serial_cfg_4, SERIAL_BUS_NAME_4, SERIAL_4_DEVICE_NAME_0);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart4 error ret %u\n", ret);
        return ERROR;
    }    
#endif

#ifdef BSP_USING_UART5
    static struct SerialCfgParam serial_cfg_5;
    memset(&serial_cfg_5, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_5;
    memset(&serial_hw_cfg_5, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_5;
    memset(&serial_dev_param_5, 0, sizeof(struct SerialDevParam));

    serial_5.dma = uart_dma_5;
    
    serial_driver_5.drv_done = &drv_done;
    serial_driver_5.configure = &Stm32SerialDrvConfigure;
    serial_device_5.hwdev_done = &hwdev_done;

    serial_cfg_5.data_cfg = data_cfg_init;

    serial_hw_cfg_5.uart_device = UART5;
    serial_hw_cfg_5.irq = UART5_IRQn;
    serial_cfg_5.hw_cfg.private_data = (void *)&serial_hw_cfg_5;
    serial_driver_5.private_data = (void *)&serial_cfg_5;

    serial_dev_param_5.serial_work_mode = SIGN_OPER_INT_RX;
#ifdef USART5_USING_DMA
    serial_dev_param_5.serial_work_mode = SIGN_OPER_DMA_RX;
#endif
    serial_device_5.haldev.private_data = (void *)&serial_dev_param_5;

    NVIC_Configuration(serial_hw_cfg_5.irq);

    ret = BoardSerialBusInit(&serial_5.serial_bus, &serial_driver_5, SERIAL_BUS_NAME_5, SERIAL_DRV_NAME_5);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart5 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_5, (void *)&serial_cfg_5, SERIAL_BUS_NAME_5, SERIAL_5_DEVICE_NAME_0);
    if (EOK != ret) {
        KPrintf("Stm32HwUsartInit usart5 error ret %u\n", ret);
        return ERROR;
    }    
#endif

    return ret;
}
